#!/bin/bash
#
######################################################################
#
# author@patrick
# 
# 功能作用：
# 检查一下192,168.1.0这个网段的所有主机那些是存活的那些是不存活的，并且把存活的ip
# 放进host文件中方便直接执行ssh互相信任关系
# 
######################################################################
#
#
#ipaddress=192.168.1.{1..254}
# 
for ((i=1;i<=254;i++));do
    {
    host=$(ping -c4 192.168.1.$i | grep "bytes from 192.168.1.$i" &> /dev/null)
    if [ $? -eq 0 ];then
	echo "192.168.1.$i" >> host
    else
	echo &> /dev/null
    fi
    }&
done
#
wait
echo "已完成"
#
exit
